{"game":{"id":1628,"name":"Super Smash Bros. Brawl","slug":"super-smash-bros-brawl","release_date":"2008-01-31","created_at":"2012-10-21 13:55:52 +0000","updated_at":"2016-04-26 14:45:02 +0000","alternative_names":[{"name":"大乱闘スマッシュブラザーズX","comment":"Japanese title"}],"summary":"Game Overview&#13;\n&#13;\n&#13;\nThe Brawl to end them all!&#13;\n&#13;\nThis action-packed fighting game features a ridiculous number of characters that have appeared on Nintendo platforms, from Mario to Link to Pikachu ... to Solid Snake! As they square off in famous locales drawn from the rich history of Nintendo, literally anything can happen - and usually does. With limitless customizing options, items and weapons that boggle the mind and a wealth of modes, this game has truly infinite replayability.&#13;\n&#13;\n&#13;\nSuper Smash Bros. Brawl features a sprawling adventure mode called \"The Subspace Emissary\" that's a full game in and of itself. Players jump and brawl their way through enemy-packed side-scrolling levels, meeting up with other characters, watching incredible cinematics and taking on massive bosses.&#13;\n&#13;\n&#13;\nFor the first time, this celebrated series is going Wi-Fi, allowing up to four players to brawl, no matter where they may be.&#13;\n&#13;\n&#13;\nWelcome to a brawl for the ages, where anything can happen, anyone can show up and all bets are off. &#13;\n&#13;\nGame storyline: &#13;\nIn multiplayer games, characters from all Nintendo universes meet up in Nintendo locales to duke it out. In the solo mode called \"The Subspace Emissary,\" the world of Smash Bros. is invaded by an entity called the Ancient Minister and his army of creatures, called \"The Primid.\" Normally, characters come alive in the world of Smash Bros. to do battle, then turn back into trophies when defeated. However, the Ancient Minister starts turning characters into trophies to harness their power, then detonates bombs that suck pieces of the world back into his realm of Subspace. Eventually, all the characters must work together to defeat the invading creatures from Subspace - this is accomplished by playing through side-scrolling levels.&#13;\n&#13;\n&#13;\nHow to progress through the game: &#13;\nFor multiplayer games, players pick characters, set rules and locations for where they want to play and then duke it out. In Solo Mode, characters play through a long, side-scrolling adventure, beating up enemies along the way as they watch short cinematics starring their favorite characters.&#13;\n&#13;\n&#13;\nCharacters: &#13;\nMario, Samus, Bowser, Donkey Kong, Solid Snake, Meta Knight, Kirby, Pikachu, Zero Suit Samus, Link, Zelda, Pit and Wario, to name just a few. Anyone and anything from a Nintendo universe could appear in this game in one form or another.&#13;\n&#13;\n&#13;\nSpecial powers/weapons/moves/features:&#13;\nAnything from a Nintendo game could conceivably be in this game, whether it's a musical score, an obscure item or a character that shows up to help the fighters. Super Smash Bros. Brawl is eminently customizable, so players can choose the frequency of items appearing, adjust musical scores and basically play the game however they'd like. Items range from baseball bats to proximity mines to Poké Balls to Assist Trophies, which spawn characters like Hammer Bros. and Sim City's Dr. Wright to attack others.&#13;","genres":[{"name":"Platform"},{"name":"Fighting"}],"themes":[{"name":"Action"}],"rating":8.122354507446289,"release_dates":[{"platform_name":"Wii","release_date":"2008-01-31"}],"companies":[{"id":70,"developer":false,"publisher":true,"name":"Nintendo"},{"id":1151,"developer":true,"publisher":false,"name":"Game Arts Co., Ltd."}],"cover":{"url":"//res.cloudinary.com/igdb/image/upload/t_cover_small/g54kkhwfu0xcwxtlb91c.png","width":800,"height":1128,"id":"g54kkhwfu0xcwxtlb91c"},"screenshots":[{"url":"//res.cloudinary.com/igdb/image/upload/t_screenshot_med/fmwvms7rcowqxqjzbfrp.jpg","title":"","width":286,"height":176,"id":"fmwvms7rcowqxqjzbfrp"},{"url":"//res.cloudinary.com/igdb/image/upload/t_screenshot_med/bqmy1jryfauldjo9a0dz.jpg","title":"","width":259,"height":194,"id":"bqmy1jryfauldjo9a0dz"},{"url":"//res.cloudinary.com/igdb/image/upload/t_screenshot_med/it2wxgm4feiotqicxtga.jpg","title":"","width":248,"height":203,"id":"it2wxgm4feiotqicxtga"},{"url":"//res.cloudinary.com/igdb/image/upload/t_screenshot_med/blptjduqhz761res6h3w.jpg","title":"","width":299,"height":168,"id":"blptjduqhz761res6h3w"}],"videos":[{"title":"Trailer","uid":"PbetJKOQB7k"}]}}